# Project Title

***FYI*** I put this in a  word doc that was submited seperatly, it makes this look alot better. I also have some hand-drawn simple graphs. 

Brayden Cummins – Checkpoint 1: Project Idea and datasets
Topic: How can the US and other countries fight Climate Change?
Project Questions: 
•	For this analysis, I want to look at all the countries around the world and see which ones have the least greenhouse gas emissions vs the most greenhouse gas emissions. 
•	I want to compare these countries and then look at how these countries do economically. For example, is there a relationship between these countries’ GDP and their carbon footprint?
•	Then after I look at just the country by their GDP, I want to see if population impacts greenhouse gas emissions.
•	Then after we get the analysis of those first few questions, I want to then take it a step further and see what bigger countries like the US can do to help the smaller countries focus on being more environmentally friendly.
What would the answer look like?
•	My answer for this project would be to visualize in python what countries are doing the best and worst at fighting climate change. I want to be able to filter these graphs down by year and by country so you can do a more in-depth analysis of certain years/countries.  
•	Also, with the population data, I want to see if the governments should crack down more on the big businesses or on the everyday person. I want to see how much the average person affects greenhouse emissions. 
•	I have always wondered which countries are doing the best and the worst when fighting climate change, and this project will fulfill my questions, by matching up greenhouse emissions with other information that could be factored into why that country is doing so good or bad in their emissions. 
•	On these visualizations, I possibly want to connect the datasets and show them in combined visualizations. So, put the data side by side to better analyze it.
•	Some basic hand-drawn examples of what I am looking for are below.
   
My Data Sources: 
•	The datasets that I have identified for this project are 2 CSV/Excel files, and an International Database. I found 2 of the datasets from Kaggle, and one from the US Census. 
•	I changed my datasets from the last assignment. As I read the feedback, I came to realize that I needed better datasets. 
•	Here are the links to the datasets:
o	https://www.kaggle.com/datasets/yoannboyere/co2-ghg-emissionsdata
o	https://www.kaggle.com/datasets/alejopaullier/-gdp-by-country-1999-2022
o	https://www.census.gov/data-tools/demo/idb/#/table?COUNTRY_YEAR=2022&COUNTRY_YR_ANIM=2022
How to relate the datasets:
•	Relating my datasets will be easy, it will be by country and country code. 
•	All my datasets clearly differentiate the countries and the years that all the data is coming from. If I want to join the datasets, I will have to do it by country (the full name) I think. They should all have the countries spelled the same, so I don’t think there will be an issue. 
Importing Data into Python:
•	I imported my datasets in python, and I uploaded it all to the GitHub repository I submitted.

In [283]:
# Importing first dataset from kaggle using opendatasets. The CO2_GHG_emissions-data.

import pandas as pd
import opendatasets as od
dataset_url = 'https://www.kaggle.com/datasets/yoannboyere/co2-ghg-emissionsdata'
od.download(dataset_url, data_dir='./data')

Skipping, found downloaded files in "./data\co2-ghg-emissionsdata" (use force=True to force download)

In [284]:
ghg = pd.read_csv('data/co2-ghg-emissionsdata/co2_emission.csv')
ghg.head(5)

        Entity Code  Year  Annual CO₂ emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

In [285]:
dataset_url = 'https://www.kaggle.com/datasets/alejopaullier/-gdp-by-country-1999-2022'
od.download(dataset_url, data_dir='./data')

Skipping, found downloaded files in "./data\-gdp-by-country-1999-2022" (use force=True to force download)

In [286]:
gdp = pd.read_csv('data/-gdp-by-country-1999-2022/GDP by Country 1999-2022.csv')
gdp.head()

,Country,1999,2000,2001,2002,2003,2004,2005,2006,2007,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0,"Afghanistan, Rep. of.",0,0,0,4.084,4.585,5.971,7.309,8.399,9.892,...,21.555,24.304,0,0,0,0,0,0,0,0
1,Albania,3.444,3.695,4.096,4.456,5.6,7.452,8.376,9.133,10.163,...,14.91,16.053,11.591,12.204,13.214,14.341,15.553,16.996,16.77,18.012
2,Algeria,48.845,54.749,55.181,57.053,68.013,85.016,102.38,114.322,116.158,...,190.432,203.449,175.077,181.71,192.256,202.179,210.906,219.16,163.812,168.195
3,Angola,6.153,9.135,8.936,11.386,13.956,19.8,30.632,43.759,55.37,...,136.415,151.089,102.011,98.815,105.369,112.533,119.403,127.15,70.339,74.953
4,Antigua and Barbuda,0.652,0.678,0.71,0.718,0.754,0.818,0.875,0.962,1.026,...,1.404,1.494,1.285,1.328,1.386,1.458,1.536,1.617,1.405,1.534

In [287]:
gdp.describe()

,Country,1999,2000,2001,2002,2003,2004,2005,2006,2007,...,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
count,180,180,180,180,180,180,180,180,180,180,...,180,180,180,180,180,180,180,180,180,180
unique,180,178,180,178,180,178,180,180,180,180,...,180,180,168,167,165,167,167,167,166,165
top,"Afghanistan, Rep. of.",0,0,7.894,4.084,4.585,5.971,7.309,8.399,9.892,...,21.555,24.304,0,0,0,0,0,0,0,0
freq,1,2,1,2,1,2,1,1,1,1,...,1,1,13,14,14,14,14,14,15,16

In [288]:
ghg.describe()

               Year  Annual CO₂ emissions (tonnes )
count  20853.000000                    2.085300e+04
mean    1953.339424                    1.930517e+08
std       57.903089                    1.345143e+09
min     1751.000000                   -6.255223e+08
25%     1932.000000                    3.187680e+05
50%     1971.000000                    3.828880e+06
75%     1995.000000                    3.706898e+07
max     2017.000000                    3.615326e+10

In [289]:
import requests

def global_pop(year):
    call = "https://api.census.gov/data/timeseries/idb/5year?get=NAME,POP,CBR,CDR,E0,AREA_KM2&GENC=*&YR=" + year
    response = requests.get(call)
    census_data = pd.DataFrame.from_records(response.json()[1:], columns=response.json()[0])
    return census_data

global_pop = global_pop("2014")
global_pop.describe()

           NAME    POP     CBR     CDR     E0 AREA_KM2 GENC    YR
count       227    227     227     227    226      227  227   227
unique      227    227     218     199    216      226  227     1
top     Andorra  85563  9.2700  5.3200  76.68       54   AD  2014
freq          1      1       2       3      2        2    1   227

# Cleaning my datasets - Checkpoint 2 Data Cleaning

In [290]:
##I am working on finding out which year has the best data in my datasets. So I'm trying to find out what year has the least amount of 0's and Nulls. First, I need to clean up the datasets and columns
gdp_2021 = pd.DataFrame(gdp, columns=['Country', '2021'])
gdp_2021['2021'] = gdp_2021['2021'].str.replace(",", "")

gdp_2021['2021'] = gdp_2021['2021'].astype(float)
gdp_2021.describe()

               2021
count    180.000000
mean     516.611517
std     2201.306179
min        0.000000
25%        8.138500
50%       37.873000
75%      279.505250
max    22939.580000

In [291]:
#So I can see here that out of the 180 countries in this dataset, there are 15 countries with 0 GDP.
#I'm going to look for a different year to see if its the same. 
gdp_2021[gdp_2021['2021'] == 0]

                                    Country  2021
0                     Afghanistan, Rep. of.   0.0
10                             Bahamas, The   0.0
30                               Cape Verde   0.0
37            Congo, Democratic Republic of   0.0
38                       Congo, Republic of   0.0
59                              Gambia, The   0.0
76                Iran, Islamic Republic of   0.0
89         Lao People's Democratic Republic   0.0
91                                  Lebanon   0.0
97   Macedonia, Former Yugoslav Republic of   0.0
121                                Pakistan   0.0
152                               Swaziland   0.0
155                    Syrian Arab Republic   0.0
160               Timor-Leste, Dem. Rep. of   0.0
177                      Yemen, Republic of   0.0

In [292]:
#As you can see, 2014 has only 1 country with 0's for the GDP, so I'm going to use 2014 for my calculations. 
gdp_2014 = pd.DataFrame(gdp, columns=['Country', '2014'])
gdp_2014['2014'] = gdp_2014['2014'].str.replace(",", "")
gdp_2014['2014'] = gdp_2014['2014'].astype(float)

gdp_2014[gdp_2014['2014'] == 0]

          Country  2014
166  Turkmenistan   0.0

In [293]:
#Cleaning up this dataframe
gdp_2014.columns = ('Country', 'GDP (In US Billions)')
gdp_2014.head(15)

                  Country  GDP (In US Billions)
0   Afghanistan, Rep. of.                24.304
1                 Albania                16.053
2                 Algeria               203.449
3                  Angola               151.089
4     Antigua and Barbuda                 1.494
5               Argentina               347.731
6                 Armenia                10.821
7               Australia              1125.820
8                 Austria               430.611
9              Azerbaijan                65.776
10           Bahamas, The                 8.287
11                Bahrain                27.165
12             Bangladesh               133.176
13               Barbados                 4.445
14                Belarus                91.501

In [294]:
ghg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20853 entries, 0 to 20852
Data columns (total 4 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Entity                          20853 non-null  object
 1   Code                            18646 non-null  object
 2   Year                            20853 non-null  int64
 3   Annual CO₂ emissions (tonnes )  20853 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 651.8+ KB

In [295]:
#I figured out that this dataset had continents in it as well, so I dropped the rows that didn't have a country code. Now I will check for more nulls. 
ghg_2014_1 = ghg[ghg['Year'] == 2014]
ghg_2014 = ghg_2014_1.dropna()

len(ghg_2014)

216

In [296]:
ghg_2014.head(5)

          Entity Code  Year  Annual CO₂ emissions (tonnes )
65   Afghanistan  AFG  2014                    9.789186e+06
417      Albania  ALB  2014                    5.712176e+06
525      Algeria  DZA  2014                    1.431771e+08
820      Andorra  AND  2014                    4.616640e+05
888       Angola  AGO  2014                    3.445764e+07

In [297]:
#We have no nulls, that's great!
ghg_2014.isnull().sum()

Entity                            0
Code                              0
Year                              0
Annual CO₂ emissions (tonnes )    0
dtype: int64

In [298]:
#Same with this dataset, no nulls. We already checked for 0's in this one, so we sould be good. 
gdp_2014.isnull().sum()

Country                 0
GDP (In US Billions)    0
dtype: int64

In [299]:
#Checking for zeros for the green house gas emissions. 
ghg_2014[ghg_2014['Annual CO₂ emissions (tonnes )'] == 0].count()

Entity                            0
Code                              0
Year                              0
Annual CO₂ emissions (tonnes )    0
dtype: int64

In [300]:
#Now, I need to work on the last dataset. The first two I have got rid of the nulls, zeros, not needed rows, and changed all the datatypes so they can be used.
#In my data, there is going to be large and small numbers. Smaller and bigger countries, so getting rid ot outliers would not be so good. While i'm using the data, 
# I will fact check some numbers to make sure they are correct.

In [301]:
global_pop.head(15)

,NAME,POP,CBR,CDR,E0,AREA_KM2,GENC,YR
0,Andorra,85563,8.4700,6.7200,82.94,468,AD,2014
1,United Arab Emirates,9170474,10.4500,1.2300,78.05,83600,AE,2014
2,Afghanistan,31809829,38.8000,14.1800,50.49,652230,AF,2014
3,Antigua and Barbuda,91115,15.9500,5.8100,75.53,443,AG,2014
4,Anguilla,16058,12.5800,4.4200,80.93,91,AI,2014
5,Albania,3026779,12.6700,6.2300,78.67,27398,AL,2014
6,Armenia,3060577,13.9200,9.3100,74.12,28203,AM,2014
7,Angola,26314148,46.0100,10.0500,59.02,1246700,AO,2014
8,Argentina,43057355,17.4500,7.6000,76.69,2736690,AR,2014
9,American Samoa,53078,20.4200,4.8800,74.54,198,AS,2014
10,Austria,8615171,9.3600,9.4100,81.27,82445,AT,2014
11,Australia,23292143,12.8700,6.5900,82.19,7682300,AU,2014
12,Aruba,110627,12.6500,8.0100,76.19,180,AW,2014
13,Azerbaijan,9686433,16.9300,7.0600,71.89,82629,AZ,2014
14,Bosnia and Herzegovina,3870503,8.8900,9.7400,76.32,51187,BA,2014

In [302]:
#This dataset is looking good, no nulls except for the E0 column, so i'll drop the columns that i'm not going to use. 
global_pop.isnull().sum()

NAME        0
POP         0
CBR         0
CDR         0
E0          1
AREA_KM2    0
GENC        0
YR          0
dtype: int64

In [303]:
#Now I have the columns that I want
global_pop.drop(global_pop.columns[[2,3,4,7]], axis=1, inplace=True)
global_pop.head()

                   NAME       POP AREA_KM2 GENC
0               Andorra     85563      468   AD
1  United Arab Emirates   9170474    83600   AE
2           Afghanistan  31809829   652230   AF
3   Antigua and Barbuda     91115      443   AG
4              Anguilla     16058       91   AI

In [304]:
gdp_2014.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 2 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Country               180 non-null    object
 1   GDP (In US Billions)  180 non-null    float64
dtypes: float64(1), object(1)
memory usage: 2.9+ KB

In [306]:
ghg_2014.columns = ('Country', 'Code', 'Year', 'Annual Emissions (Tonnes)')
global_pop.columns = ('Country', 'Population', 'Area (KM)', 'GENC')

# Now that I have clean code, I'm going to try and join them based on their name.
## I can already see I'm going to have to do some manipulating of the names, because not all of them are the same.

In [434]:
data_check = ghg_2014.merge(global_pop, how='outer', on=['Country'])
data_check2 = global_pop.merge(ghg_2014, how='outer', on=['Country'])
len(data_check)

235

In [308]:
len(ghg_2014)

216

In [309]:
len(global_pop)

227

In [435]:
#trying to figure out why I have nulls, its probably because of the country names not matching up
data_check[data_check['Population'].isnull()]

,Country,Code,Year,Annual Emissions (Tonnes),Population,Area (KM),GENC
65,Falkland Islands,FLK,2014.0,5.496000e+04,NaN,NaN,NaN
69,French Guiana,GUF,2014.0,7.328000e+05,NaN,NaN,NaN
80,Guadeloupe,GLP,2014.0,2.564800e+06,NaN,NaN,NaN
123,Martinique,MTQ,2014.0,2.297328e+06,NaN,NaN,NaN
144,Niue,NIU,2014.0,1.099200e+04,NaN,NaN,NaN
150,Palestine,PSE,2014.0,2.835936e+06,NaN,NaN,NaN
159,Reunion,REU,2014.0,4.169632e+06,NaN,NaN,NaN
212,World,OWID_WRL,2014.0,3.550583e+10,NaN,NaN,NaN

In [449]:
test = global_pop[global_pop['Country'].str.startswith('N')]
test

                      Country Population Area (KM) GENC
107               North Korea   24899182    120408   KP
135  Northern Mariana Islands      53069       472   MP
145                   Namibia    2340420    823290   NA
146             New Caledonia     267874     18275   NC
147                     Niger   18176446   1266700   NE
148                   Nigeria  184193052    910768   NG
149                 Nicaragua    5836758    119990   NI
150               Netherlands   16874277     33893   NL
151                    Norway    5147527    304282   NO
152                     Nepal   28291654    143351   NP
153                     Nauru       9446        21   NR
154               New Zealand    4442509    264537   NZ

In [433]:
global_pop.at[198, 'Country'] = 'Timor'

In [ ]:
## What I did above was match up the names, All the names didnt match. So I went through the global_pop dataframe and replaced the values that didnt match with the matching names. I used its index to replace 
## the values. 

#I started out with around 20 something values that didnt match and I ended with 8, I couldnt find matches for the ones that are left.

In [453]:
##This is the inner join, so we should only get values that match. 
final_data_1 = ghg_2014.merge(global_pop, how='inner', on=['Country'])
len(final_data_1)

208

In [568]:
final_data = final_data_1.merge(gdp_2014, how='outer', on=['Country'])

final_data[final_data['Population'].isnull()]

,Country,Code,Year,Annual Emissions (Tonnes),Population,Area (KM),GENC,GDP (In US Billions)
208,Korea,NaN,NaN,NaN,NaN,NaN,NaN,1167.690
209,Sudan,NaN,NaN,NaN,NaN,NaN,NaN,98.222

In [566]:
test2 = gdp_2014[gdp_2014['Country'].str.startswith('Yemen')]
test2

                Country  GDP (In US Billions)
177  Yemen, Republic of                42.687

In [567]:
gdp_2014.at[177, 'Country'] = 'Yemen'

In [565]:
##I did the same thing with the names when I joined the 3rd dataset. I got it down to a few missing countries. Now time for the inner join. Ater the inner I should have my main dataset ready. 
test3 = final_data_1[final_data_1['Country'].str.startswith('Yemen')]
test3

    Country Code  Year  Annual Emissions (Tonnes) Population Area (KM) GENC
205   Yemen  YEM  2014                22262570.05   26019667    527968   YE

In [571]:
final_data = ghg_2014.merge(global_pop, how='inner', on=['Country'])

final_data.head(5)

       Country Code  Year  Annual Emissions (Tonnes) Population Area (KM) GENC
0  Afghanistan  AFG  2014               9.789186e+06   31809829    652230   AF
1      Albania  ALB  2014               5.712176e+06    3026779     27398   AL
2      Algeria  DZA  2014               1.431771e+08   38806577   2381740   DZ
3      Andorra  AND  2014               4.616640e+05      85563       468   AD
4       Angola  AGO  2014               3.445764e+07   26314148   1246700   AO